[{"id":"EPIC-1","title":"User Authentication and Security Management","summary":"Build a secure multi-factor authentication system for the banking portal","description":"Develop a robust authentication system that enables customers to log in securely using multi-factor authentication. Implement secure password management, session handling, identity verification, and compliance with data security regulations. This epic ensures that customer data and transactions are protected from unauthorized access.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard and Product Display","summary":"Create a personalized, responsive dashboard displaying customer-specific banking products","description":"Design and implement a personalized dashboard that dynamically shows banking products and services based on the customer’s profile, eligibility, and account type. Ensure that users can navigate easily, view their financial status, and access relevant actions through an intuitive, responsive interface.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Account Opening and Service Request Workflows","summary":"Enable digital account opening and service request submission workflows","description":"Develop workflow-driven features that allow customers to initiate and complete account opening requests and modify services online. The workflow should minimize the number of clicks required for completion and guide users step-by-step with necessary validations and status tracking.","dependencies":["EPIC-2"]},{"id":"EPIC-4","title":"Status Tracking and Notifications","summary":"Provide real-time updates and notifications for customer service requests","description":"Implement features that automatically send real-time status updates and email notifications to customers regarding their submitted account requests and service modifications. Ensure updates are synchronized with back-end systems and easily visible on the dashboard.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Application Persistence and Document Uploads","summary":"Enable draft-saving capability and secure document uploads for service requests","description":"Allow users to save incomplete applications as drafts and continue them later without data loss. Provide functionality for secure document uploads, ensuring data encryption and validation checks to meet regulatory compliance and enhance the user experience.","dependencies":["EPIC-3"]},{"id":"EPIC-6","title":"Core Banking System Integration","summary":"Integrate the self-service portal with existing bank core systems","description":"Ensure the self-service portal integrates seamlessly with the existing core banking system through secure APIs. The integration should enable real-time data synchronization, request processing, and retrieval of customer information without affecting performance.","dependencies":["EPIC-3"]},{"id":"EPIC-7","title":"Role-Based Access Control and Authorization","summary":"Implement role-based access and authorization policies","description":"Define and implement role-based access control (RBAC) ensuring that customers and bank staff only access features permitted by their roles. This will restrict access to sensitive data and ensure compliance with internal and regulatory security standards.","dependencies":["EPIC-1"]},{"id":"EPIC-8","title":"Interaction History and Audit Management","summary":"Maintain detailed interaction and activity logs for all customer actions","description":"Build a comprehensive logging system that captures customer interactions, transactions, and service requests. Ensure audit trails are searchable and reportable for internal reviews, compliance, and customer transparency.","dependencies":["EPIC-3"]},{"id":"EPIC-9","title":"Responsive Design and Cross-Device Compatibility","summary":"Ensure the portal offers a consistent experience across devices","description":"Implement a responsive design framework ensuring seamless functionality and consistent user experience across desktops, tablets, and mobile devices. Optimize layouts, navigation, and interaction elements to support accessibility and usability enhancements.","dependencies":["EPIC-2"]}]