[{"id":"EPIC-1","title":"Secure Authentication and Role-Based Access","summary":"Implement secure login with multi-factor authentication and role-based access controls","description":"Develop a robust authentication module that allows customers to securely log into the self-service portal using multi-factor authentication (MFA). Implement role-based access controls (RBAC) to ensure each user can access only the services relevant to their profile and authorization level. Include features such as session timeout, password encryption, and device validation to enhance overall security.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard and Product Display","summary":"Design a personalized banking dashboard for eligible products and services","description":"Create a responsive and personalized dashboard displaying relevant banking products, services, and account details based on the user’s profile, eligibility, and relationship with the bank. Provide data summaries, quick navigations, and personalized suggestions to improve user engagement and experience.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Online Account Opening and Service Modification Workflows","summary":"Enable self-service workflows for account opening and service modifications","description":"Implement guided digital workflows that allow customers to open new accounts, modify existing services, or submit service requests without visiting a branch. Include real-time data validation, progress tracking, and streamlined steps to reduce clicks and improve efficiency while maintaining compliance requirements.","dependencies":["EPIC-2"]},{"id":"EPIC-4","title":"Status Tracking and Notifications","summary":"Provide real-time updates and notifications for customer requests","description":"Develop features that allow users to track the status of their submitted service requests in real-time. Integrate email and in-portal notifications to alert users when requests are submitted, approved, or require action, ensuring transparency and timely communication.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Application Drafts and Document Upload","summary":"Allow users to save incomplete applications and upload necessary documents securely","description":"Enable customers to save application progress as drafts so they can resume later without losing data. Implement secure file upload functionalities to allow users to attach required documents during application or modification requests, ensuring encrypted storage and validation.","dependencies":["EPIC-3"]},{"id":"EPIC-6","title":"Core Banking Integration and Data Synchronization","summary":"Integrate the self-service portal with the bank’s core systems for seamless data flow","description":"Ensure the self-service portal integrates seamlessly with the bank’s core banking systems using secure APIs. Synchronize customer information, transactions, and account updates between the systems in real-time while maintaining data integrity, performance, and reliability.","dependencies":["EPIC-3"]},{"id":"EPIC-7","title":"Interaction History and Data Security","summary":"Maintain complete user interaction logs and ensure protection of sensitive data","description":"Implement an interaction history module that tracks customer activities, including account requests, modifications, and transactions. Ensure that sensitive financial data remains secure with encryption, access controls, and compliance with data protection regulations.","dependencies":["EPIC-3"]},{"id":"EPIC-8","title":"Responsive and Accessible UI Design","summary":"Ensure a consistent and accessible customer experience across all devices","description":"Build a responsive and adaptive portal design for desktop, tablet, and mobile devices ensuring a seamless and intuitive experience. Comply with accessibility standards, optimize interface performance, and maintain design consistency across platforms.","dependencies":["EPIC-2"]}]