[{"id":"EPIC-1","title":"User Authentication and Role-Based Access Control","summary":"Implement secure authentication with multi-factor verification and role-based permissions","description":"Develop and deploy a secure authentication mechanism allowing users to log in through multi-factor authentication (MFA). Implement role-based access controls (RBAC) to ensure each user can view and perform only the actions they are authorized for. Include account management, session timeout, and secure credential handling to comply with banking data protection standards.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard and Navigation","summary":"Create a customized dashboard showing relevant banking products and services","description":"Design a user-centric dashboard displaying banking products and services based on each customer’s profile, account type, and eligibility. The dashboard will provide easy navigation to different services, quick access to critical financial information, and personalized recommendations, all presented in an intuitive and modern interface.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Digital Account Opening and Service Requests","summary":"Enable customers to open accounts or request changes through digital workflows","description":"Build automated and guided workflows that allow customers to initiate and complete account opening and service modification requests online. The workflows should provide step-by-step navigation, minimize data entry, validate information in real-time, and connect to necessary approval and verification processes to ensure compliance and efficiency.","dependencies":["EPIC-2"]},{"id":"EPIC-4","title":"Request Tracking and Notifications","summary":"Provide real-time tracking and automated notifications for customer requests","description":"Introduce a tracking system that enables users to monitor the progress of their submitted applications or service modification requests. Integrate real-time updates and send automated email and in-portal notifications to keep users informed of request statuses, approvals, and required actions.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Draft Management and Document Upload","summary":"Allow users to save incomplete workflows and upload documents securely","description":"Implement functionality allowing users to save in-progress applications as drafts and resume them later without losing data. Enable secure document uploads during application or modification processes, ensuring encryption, validation, and proper metadata tagging for compliance and auditability.","dependencies":["EPIC-3"]},{"id":"EPIC-6","title":"Core Banking System and Database Integration","summary":"Integrate the portal with existing banking systems and maintain an optimized database layer","description":"Develop a robust integration layer between the self-service portal and the bank’s core banking systems to enable real-time data synchronization. Maintain a dedicated database for portal operations to support performance optimization, reliability, and scalability while ensuring data consistency across systems.","dependencies":["EPIC-3"]},{"id":"EPIC-7","title":"Interaction History and Data Security","summary":"Record all customer interactions securely while ensuring data protection","description":"Implement an interaction history feature that records all customer actions, transactions, and requests. Ensure end-to-end data security through encryption, access controls, and regular audits. The history should be easily accessible for users and administrators in a transparent and secure manner.","dependencies":["EPIC-3"]},{"id":"EPIC-8","title":"Responsive, Accessible, and Consistent Design","summary":"Ensure a consistent, responsive user interface across all devices","description":"Design and implement a responsive web interface to provide seamless user experiences across desktops, tablets, and mobile devices. Comply with accessibility standards to support all users, including those with disabilities. Prioritize performance optimization, cross-browser compatibility, and visual consistency across screen sizes.","dependencies":["EPIC-2"]}]