[{"id":"EPIC-1","title":"Secure Authentication and Access Control","summary":"Implement secure login with multi-factor authentication and role-based permissions","description":"Develop a robust authentication system that uses multi-factor authentication (MFA) for secure login. Implement role-based access controls (RBAC) so users can only access features and data relevant to their profiles. Include password recovery options, session timeouts, and audit tracking to ensure regulatory compliance and data protection.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard and Navigation","summary":"Design a personalized dashboard displaying relevant banking products and insights","description":"Develop a responsive and customizable dashboard that dynamically displays banking products, services, and financial insights tailored to the customer profile and eligibility. Enable quick navigation to frequently used features and relevant account summaries, providing an intuitive and engaging experience across devices.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Digital Account Opening and Service Workflows","summary":"Enable customers to open new accounts and modify existing services online","description":"Build digital workflows that allow customers to initiate account opening and service modification requests seamlessly. Employ a guided interface with step-by-step instructions, real-time validations, and minimal clicks to simplify user interactions while ensuring compliance with internal banking policies.","dependencies":["EPIC-2"]},{"id":"EPIC-4","title":"Real-Time Tracking and Notifications","summary":"Provide users with real-time status updates and smart notifications","description":"Implement a status tracking interface for all active requests such as account openings or service modifications. Integrate push/email notifications and alerts to keep customers informed of progress, approvals, or pending actions, enabling transparency and reducing dependency on customer service support.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Draft Saving and Document Upload Functionality","summary":"Allow users to save incomplete applications and upload documents securely","description":"Introduce a secure draft system to let users pause and resume applications without data loss. Add document upload and management capabilities, allowing customers to attach mandatory documentation safely using encryption-based storage and secure transmission protocols.","dependencies":["EPIC-3"]},{"id":"EPIC-6","title":"Core Banking System Integration","summary":"Integrate with the core banking system for real-time data and transactions","description":"Integrate the self-service portal with the bank’s core systems using secure APIs for bi-directional communication. Ensure synchronization of customer records, account details, and request statuses in real-time while maintaining data consistency and performance optimization.","dependencies":["EPIC-3"]},{"id":"EPIC-7","title":"Interaction History and Data Security","summary":"Maintain detailed interaction history ensuring secure data management","description":"Develop an activity history feature that records user interactions, transaction requests, and notifications securely. Implement encryption for sensitive data both in transit and at rest, along with audit logging to meet compliance and maintain system transparency.","dependencies":["EPIC-3"]},{"id":"EPIC-8","title":"Responsive User Experience Across Devices","summary":"Ensure a consistent, high-performance user interface across multiple devices","description":"Design and optimize the self-service portal for responsive display and consistent behavior across desktops, tablets, and mobile devices. Follow accessibility standards and cross-browser compatibility requirements to ensure a seamless experience for all users, regardless of device type or screen size.","dependencies":["EPIC-2"]}]