[{"id":"EPIC-1","title":"Secure Authentication and Access Control","summary":"Implement secure user authentication and authorization mechanisms","description":"Develop a secure authentication system incorporating multi-factor authentication (MFA) to protect user access. Implement role-based access controls to ensure each user can access only the products and services permitted by their profile. Include secure password management, session handling, and device recognition.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard Experience","summary":"Design a personalized dashboard for users to view relevant products and services","description":"Build a user dashboard that dynamically displays banking products and services based on customer profile, eligibility, and relationship with the bank. Ensure the dashboard provides quick navigation links, financial summaries, and shortcuts to frequently used services in an intuitive interface.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Account Opening and Service Modification Workflows","summary":"Develop online workflows for account creation and service change requests","description":"Create digital workflows allowing customers to submit new account opening requests and make service modifications. Ensure a streamlined design that minimizes the number of steps, validates user input, and supports guided progression with clear status indicators.","dependencies":["EPIC-2"]},{"id":"EPIC-4","title":"Status Updates and Notifications","summary":"Provide real-time updates and notifications for user-submitted requests","description":"Enable real-time request tracking with visible progress indicators and automated notifications. Integrate an email and in-portal notification system to alert users about updates, approvals, or pending actions on their account requests or modifications.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Application Persistence and Document Management","summary":"Allow users to save in-progress applications and upload required documents","description":"Implement features enabling users to save incomplete application forms as drafts and resume them later. Provide document upload functionality allowing customers to attach identification and verification documents securely within applications.","dependencies":["EPIC-3"]},{"id":"EPIC-6","title":"Core Banking System Integration","summary":"Integrate the portal with the bank’s existing core systems for real-time data exchange","description":"Connect the self-service portal with the core banking system for real-time synchronization of customer data, account details, and service requests. Ensure secure API communication and seamless transaction processing while maintaining high system performance.","dependencies":["EPIC-3"]},{"id":"EPIC-7","title":"Interaction History and Audit Logging","summary":"Maintain complete records of customer interactions and requests","description":"Develop a comprehensive history tracking module that logs all customer interactions, transactions, and requests. Ensure compliance with audit and regulatory requirements by storing traceable activity logs accessible by authorized personnel.","dependencies":["EPIC-3"]},{"id":"EPIC-8","title":"Responsive and Accessible Design","summary":"Ensure consistent and accessible user experience across devices","description":"Implement responsive web design ensuring seamless experiences across desktops, tablets, and mobile devices. Include accessibility compliance features for visually or physically challenged users while maintaining design consistency and usability standards.","dependencies":["EPIC-2"]}]