[{"epic_title":"Secure Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":1,"title":"Implement secure customer login","description":"As a customer, I want to log in securely so that my account remains protected.","priority_business_value":"High","attributes_and_rules":"Must use multi-factor authentication methods such as OTP, biometrics, or email verification.","core_domain_objects":"Customer","acceptance_criteria":"1. Customer logins are verified using MFA. 2. Logins are secure and account protection is ensured.","test_cases":"Given a customer, When they log in, Then they must use MFA for verification."},{"epic_title":"Responsive User Interface Design","epic_key":"EPIC-2","number":1,"title":"Design responsive UI","description":"As a customer, I want a responsive user interface so that I can use the portal on any device.","priority_business_value":"High","attributes_and_rules":"UI should be mobile-friendly and adjust seamlessly across devices.","core_domain_objects":"UI, Device","acceptance_criteria":"1. The portal interface adapts to different devices. 2. User experience is consistent across devices.","test_cases":"Given a device, When the portal is accessed, Then the UI should adjust to the device."},{"epic_title":"Personalized Dashboard Experience","epic_key":"EPIC-3","number":1,"title":"Display account details on dashboard","description":"As a customer, I want to see my account details on the dashboard so that I can manage my finances.","priority_business_value":"Medium","attributes_and_rules":"Dashboard must display relevant account information based on user profile.","core_domain_objects":"Dashboard, Account","acceptance_criteria":"1. Dashboard displays account summaries. 2. Information is personalized based on customer profile.","test_cases":"Given a customer, When they view the dashboard, Then they see their account details."},{"epic_title":"Account and Service Request Workflows","epic_key":"EPIC-4","number":1,"title":"Open accounts online","description":"As a customer, I want to open bank accounts online so that I can start banking without branch visits.","priority_business_value":"High","attributes_and_rules":"Workflows must be simplified and efficient for online account openings.","core_domain_objects":"Account","acceptance_criteria":"1. Customers can open accounts online. 2. Process is simplified and minimal steps are required.","test_cases":"Given a customer, When they apply to open a bank account online, Then the account can be opened with minimal steps."},{"epic_title":"Real-Time Status Updates and Notifications","epic_key":"EPIC-5","number":1,"title":"Provide real-time status updates","description":"As a customer, I want real-time updates on my requests so that I know their status.","priority_business_value":"Medium","attributes_and_rules":"Status updates and notifications must be in real time.","core_domain_objects":"Request, Status","acceptance_criteria":"1. Customers receive real-time status updates. 2. Notifications are sent automatically.","test_cases":"Given a request, When the status updates, Then the customer receives a real-time notification."},{"epic_title":"Secure Document Upload and Management","epic_key":"EPIC-6","number":1,"title":"Upload documents securely","description":"As a customer, I want to upload documents securely so that my information remains protected.","priority_business_value":"High","attributes_and_rules":"Document uploads must be secure with encryption.","core_domain_objects":"Document","acceptance_criteria":"1. Documents are uploaded securely. 2. Encryption is used for data protection.","test_cases":"Given a customer, When they upload a document, Then the document is uploaded securely."},{"epic_title":"Role-Based Access Control (RBAC)","epic_key":"EPIC-7","number":1,"title":"Define user roles","description":"As an administrator, I want to define user roles so that each user has appropriate access.","priority_business_value":"Medium","attributes_and_rules":"Roles must include customers, tellers, and administrators.","core_domain_objects":"User, Role","acceptance_criteria":"1. User roles are defined. 2. Access is controlled based on roles.","test_cases":"Given an administrator, When they define roles, Then users have appropriate access levels."},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-8","number":1,"title":"Develop APIs for data synchronization","description":"As a system, I want to sync data with the core banking platform so that information stays consistent.","priority_business_value":"High","attributes_and_rules":"APIs must ensure secure data synchronization.","core_domain_objects":"API, Data","acceptance_criteria":"1. Data is synchronized securely. 2. Real-time updates are maintained.","test_cases":"Given the core banking system, When data is updated, Then it syncs with the portal."},{"epic_title":"Data Security and Audit Trail Management","epic_key":"EPIC-9","number":1,"title":"Encrypt sensitive data","description":"As a system, I want to encrypt personal and financial data so that customer information is secure.","priority_business_value":"High","attributes_and_rules":"Data must be encrypted both at rest and in transit.","core_domain_objects":"Data, Encryption","acceptance_criteria":"1. Data is encrypted. 2. Information security is ensured.","test_cases":"Given customer data, When it is stored or transmitted, Then it must be encrypted."}]