[{"epic_title":"User Authentication and Onboarding","epic_key":"EPIC-1","number":1,"title":"Secure User Registration","description":"As a new user, I want to register securely using my personal information and identity verification, so that I can create a verified banking account.","priority_business_value":"High","attributes_and_rules":"User must provide all mandatory KYC documents. Registration data must be encrypted during transmission and storage.","core_domain_objects":"User, IdentityDocument, RegistrationSession","acceptance_criteria":["User can input registration details and upload documents","Identity verification is validated before account creation","Registration confirmation is sent upon successful completion"],"test_cases":["Given a new user, When they complete registration with valid details, Then the system creates the user account and triggers KYC verification"]},{"epic_title":"User Authentication and Onboarding","epic_key":"EPIC-1","number":2,"title":"Multi-Factor Authentication for Login","description":"As a registered user, I want to securely log in using multi-factor authentication, so that I can protect my account access.","priority_business_value":"High","attributes_and_rules":"System must support password + OTP or biometric authentication; sessions should expire after inactivity.","core_domain_objects":"UserAccount, Session, AuthenticationFactor","acceptance_criteria":["Login requires username/password and OTP verification","Session tokens expire after defined inactivity period","System blocks access after multiple failed attempts"],"test_cases":["Given a valid user, When they log in with correct credentials and OTP, Then the system grants access","Given multiple invalid login attempts, When threshold exceeded, Then account access is temporarily locked"]},{"epic_title":"Customer Profile Management","epic_key":"EPIC-2","number":1,"title":"Edit Personal and Contact Information","description":"As a customer, I want to update my personal and contact details, so that my profile remains accurate and up to date.","priority_business_value":"Medium","attributes_and_rules":"Sensitive updates require identity verification; audit history must log all edits.","core_domain_objects":"CustomerProfile, Address, ContactDetails","acceptance_criteria":["User can view and edit name, address, phone, and email","System requests OTP verification for key updates","Audit log captures each edit with timestamp and user ID"],"test_cases":["Given a user, When they edit their phone number, Then system sends OTP for update verification","Given a successful update, When audit is queried, Then change details are visible"]},{"epic_title":"Accounts Overview Dashboard","epic_key":"EPIC-3","number":1,"title":"Display Consolidated Account Overview","description":"As a customer, I want to view all my accounts and balances in one dashboard, so that I can easily monitor my financial status.","priority_business_value":"High","attributes_and_rules":"Dashboard must display balances securely and be accessible across devices.","core_domain_objects":"Account, AccountSummary, DashboardWidget","acceptance_criteria":["Dashboard shows all linked accounts and balances","Account numbers are partially masked for privacy","Responsive design ensures usability on all devices"],"test_cases":["Given multiple accounts, When dashboard is loaded, Then all balances are shown with masked account numbers","Given a mobile device, When accessing dashboard, Then layout adjusts responsively"]},{"epic_title":"Funds Transfer and Payments","epic_key":"EPIC-4","number":1,"title":"Perform Domestic and International Transfers","description":"As a customer, I want to transfer funds between my accounts and to others domestically or internationally, so that I can conveniently handle payments.","priority_business_value":"High","attributes_and_rules":"All transfers must comply with AML and transaction limit regulations.","core_domain_objects":"Transfer, Beneficiary, Transaction","acceptance_criteria":["User can initiate intra-bank, inter-bank, and international transfers","System validates AML rules before processing","Transfer status updates are sent in real time"],"test_cases":["Given a valid domestic beneficiary, When user initiates transfer, Then transaction completes successfully and status is updated","Given an AML breach, When transfer is initiated, Then system rejects transaction"]},{"epic_title":"Bill Payment Services","epic_key":"EPIC-5","number":1,"title":"Pay Recurring and One-Time Bills","description":"As a customer, I want to pay my utility and credit card bills, so that I can manage recurring payments easily.","priority_business_value":"Medium","attributes_and_rules":"User must be able to add billers, schedule or pay instantly, and view payment history.","core_domain_objects":"Biller, BillPayment, PaymentSchedule","acceptance_criteria":["User can link and manage multiple billers","Recurring payment schedules can be set and edited","Instant confirmation receipt is displayed for payments"],"test_cases":["Given a biller linked, When user makes instant payment, Then system generates confirmation receipt","Given a recurring schedule, When due date arrives, Then system auto-initiates payment"]},{"epic_title":"Transaction History and Statements","epic_key":"EPIC-6","number":1,"title":"View and Download Transaction History","description":"As a user, I want to access transaction history and download account statements, so that I can keep records for reference.","priority_business_value":"High","attributes_and_rules":"Users must be able to filter by date/type and download in supported formats.","core_domain_objects":"Transaction, Statement, FilterCriteria","acceptance_criteria":["Transactions can be filtered by date, type, and amount","Statements downloadable in PDF, CSV, or XLS formats","Delivery option available via email or notification"],"test_cases":["Given past transactions, When user filters by date, Then system displays matching records","Given a statement request, When user selects PDF, Then file downloads successfully"]},{"epic_title":"Card Management Tools","epic_key":"EPIC-7","number":1,"title":"Manage Debit and Credit Cards","description":"As a customer, I want to manage my debit and credit cards, so that I can control usage and security.","priority_business_value":"High","attributes_and_rules":"User must be able to view, freeze/unfreeze, and set transaction limits on cards.","core_domain_objects":"Card, CardLimit, CardStatus","acceptance_criteria":["User can view active cards and last transactions","Card can be temporarily suspended or reactivated","Transaction limits can be modified and saved"],"test_cases":["Given an active card, When user suspends it, Then card status updates to inactive","Given a limit change, When saved, Then system applies new limit immediately"]},{"epic_title":"Loans and Credit Services","epic_key":"EPIC-8","number":1,"title":"Apply for and Manage Loans","description":"As a customer, I want to apply for loans and track their progress, so that I can manage my credit effectively.","priority_business_value":"Medium","attributes_and_rules":"Eligibility and document uploads must be verified before approval.","core_domain_objects":"LoanApplication, LoanEligibility, DocumentUpload","acceptance_criteria":["User can select loan type and view eligibility result","Documents can be uploaded securely for verification","Loan status updates are viewable post-submission"],"test_cases":["Given eligible customer, When loan application submitted with complete documents, Then system triggers review process","Given under review status, When decision ready, Then update shown in app"]},{"epic_title":"Alerts and Notification System","epic_key":"EPIC-9","number":1,"title":"Receive Real-Time Account Notifications","description":"As a customer, I want to receive real-time alerts for transactions and security events, so that I can stay informed about my account activity.","priority_business_value":"High","attributes_and_rules":"User preferences control channels and frequency for notifications.","core_domain_objects":"Notification, UserPreference, MessageTemplate","acceptance_criteria":["User receives alerts for all transactions and login events","Preferences can be set for SMS, email, or push notification","System differentiates normal and high-risk alerts"],"test_cases":["Given a transaction, When completed, Then system sends notification as per user preference","Given new device login, When detected, Then user receives security alert"]},{"epic_title":"Security and Fraud Monitoring","epic_key":"EPIC-10","number":1,"title":"Monitor and Detect Fraudulent Activities","description":"As a security officer, I want to monitor and detect fraudulent activities in real time, so that I can protect customers and the institution.","priority_business_value":"High","attributes_and_rules":"AI and rule-based detection algorithms should evaluate transactions continuously.","core_domain_objects":"Transaction, RiskScore, Alert","acceptance_criteria":["System performs continuous fraud checks on transactions","High-risk transactions are flagged for manual review","Security rules can be updated dynamically"],"test_cases":["Given a suspicious transaction, When detected by engine, Then flag is raised for review","Given a rule update, When applied, Then monitoring logic reflects new condition"]},{"epic_title":"Financial Insights and Recommendations","epic_key":"EPIC-11","number":1,"title":"Provide Personalized Financial Insights","description":"As a customer, I want to receive insights into my spending and saving trends, so that I can improve financial planning.","priority_business_value":"Medium","attributes_and_rules":"System should analyze spending data and suggest saving/investment opportunities.","core_domain_objects":"SpendingPattern, Insight, Recommendation","acceptance_criteria":["Insights are generated from categorized transaction data","Graphs show monthly trends for income and expenses","Recommendations are personalized based on behavior"],"test_cases":["Given complete transaction history, When analyzed, Then system generates spending summary graph","Given a user with surplus funds, When insights calculated, Then recommendation for savings product displayed"]},{"epic_title":"Customer Support and Chatbot Integration","epic_key":"EPIC-12","number":1,"title":"Provide AI-Driven Customer Chat Support","description":"As a customer, I want to interact with an intelligent chatbot for my queries, so that I can get instant assistance or connect to support agents.","priority_business_value":"Medium","attributes_and_rules":"Chatbot handles FAQs; unresolved issues escalate to human support.","core_domain_objects":"ChatSession, SupportTicket, KnowledgeBase","acceptance_criteria":["User can ask common questions and receive instant replies","Chatbot creates ticket for unresolved queries","System supports live agent transfer and ticket tracking"],"test_cases":["Given a user question, When chatbot matches FAQ, Then answer is returned instantly","Given an unresolved issue, When user requests support, Then ticket created and assigned"]}]