[{"epic_title":"Secure Authentication and Role-Based Access","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication (MFA)","description":"As a customer, I want to log in using multi-factor authentication, so that my account remains secure from unauthorized access.","priority_business_value":"High","attributes_and_rules":"The system must support MFA using SMS, email, or authentication apps.","core_domain_objects":"User, Authentication, Session","acceptance_criteria":["Given I am a registered user, When I log in, Then I should be prompted to provide a second factor for authentication."],"test_cases":["Given I am a registered user, When I enter my credentials, Then I should receive a prompt for MFA."]},{"epic_title":"Secure Authentication and Role-Based Access","epic_key":"EPIC-1","number":2,"title":"Implement Role-Based Access Control (RBAC)","description":"As a user, I want to access only services relevant to my role, so that I can use the platform effectively and securely.","priority_business_value":"High","attributes_and_rules":"Access control must be based on predefined roles and permissions.","core_domain_objects":"User, Role, Service","acceptance_criteria":["Given a user with specific roles, When they log in, Then they should only see and access services permitted to their roles."],"test_cases":["Given a user with the admin role, When they log in, Then they should access all services.","Given a user with the guest role, When they log in, Then they should only access guest services."]},{"epic_title":"Personalized User Dashboard","epic_key":"EPIC-2","number":1,"title":"Design Personalized Dashboard","description":"As a user, I want to see a personalized dashboard displaying relevant banking products, so that I can easily access services that are suitable for me.","priority_business_value":"Medium","attributes_and_rules":"Dashboard elements must dynamically adjust based on user profile.","core_domain_objects":"User, Dashboard, Product","acceptance_criteria":["Given a user profile, When the user accesses the dashboard, Then it should display banking products relevant to their profile."],"test_cases":["Given a user profile with credit card eligibility, When the user accesses the dashboard, Then it should display credit card products."]},{"epic_title":"Account Opening and Service Modification Workflows","epic_key":"EPIC-3","number":1,"title":"Develop Account Opening Workflow","description":"As a user, I want to open new accounts via an online workflow, so that I can avoid visiting a branch.","priority_business_value":"High","attributes_and_rules":"Workflow must validate user data and provide contextual guidance.","core_domain_objects":"User, Account","acceptance_criteria":["Given account creation guidelines, When a user completes the workflow, Then the new account should be created and accessible."],"test_cases":["Given valid user data, When the user submits the account creation form, Then the account is created and the user receives confirmation."]},{"epic_title":"Status Tracking and Notifications","epic_key":"EPIC-4","number":1,"title":"Enable Status Tracking for Requests","description":"As a user, I want to track the status of my requests in real-time, so that I stay informed about progress and pending actions.","priority_business_value":"High","attributes_and_rules":"Tracking system must provide real-time updates and notifications.","core_domain_objects":"User, Request","acceptance_criteria":["Given a submitted request, When the status changes, Then the user should see the real-time status and receive notifications."],"test_cases":["Given a pending request, When its status changes to approved, Then the user should see the updated status and receive an email notification."]},{"epic_title":"Draft Saving and Document Management","epic_key":"EPIC-5","number":1,"title":"Enable Application Draft Saving","description":"As a user, I want to save my incomplete applications as drafts, so that I can continue later without losing progress.","priority_business_value":"Medium","attributes_and_rules":"Drafts must be saved securely and retrievable by the user.","core_domain_objects":"User, Application","acceptance_criteria":["Given an incomplete application, When the user saves it as a draft, Then the draft should be securely saved and retrievable."],"test_cases":["Given an incomplete application, When the user clicks 'Save as Draft', Then the application data should be saved and retrievable later."]},{"epic_title":"Core Banking Integration and Data Synchronization","epic_key":"EPIC-6","number":1,"title":"Implement Core Banking Integration","description":"As a system administrator, I want the portal to integrate with core banking systems, so that data synchronization occurs in real-time.","priority_business_value":"High","attributes_and_rules":"Integration must use secure APIs and ensure data integrity.","core_domain_objects":"Banking System, User, Request","acceptance_criteria":["Given an API endpoint, When a user makes a request, Then the core banking system should reflect the request in real-time."],"test_cases":["Given a request submission, When the system calls the API, Then the core banking details should synchronize immediately."]},{"epic_title":"Interaction History and Audit Logging","epic_key":"EPIC-7","number":1,"title":"Implement Interaction History Logging","description":"As a user, I want to view my interaction history for transparency, so that I have a record of my requests and activities.","priority_business_value":"Medium","attributes_and_rules":"Logs must be kept securely and be retrievable by users and administrators.","core_domain_objects":"User, Interaction","acceptance_criteria":["Given recent interactions, When a user accesses their history, Then they should see a log of all submitted requests and activities."],"test_cases":["Given a user's request history, When the user checks their interaction log, Then they should see all activities listed chronologically."]},{"epic_title":"Responsive Design and Cross-Device Optimization","epic_key":"EPIC-8","number":1,"title":"Implement Responsive Portal Design","description":"As a user, I want the portal to be optimized for different devices, so that I can have a consistent experience across desktop, tablet, and mobile.","priority_business_value":"Medium","attributes_and_rules":"Design must adapt fluidly to varying screen sizes and resolutions.","core_domain_objects":"User, Device, Portal","acceptance_criteria":["Given different devices, When a user accesses the portal, Then it should display optimally regardless of the device."],"test_cases":["Given access via desktop, tablet, and mobile, When the user opens the portal, Then the design should be responsive and consistent."]}]