[{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":1,"title":"User Registration and Login Setup","description":"As a customer, I want to securely register and log in so that I can access my banking services online.","priority_business_value":"High","attributes_and_rules":["The system must support secure registration and login procedures."],"core_domain_objects":["Customer","User Account"],"acceptance_criteria":["Given I am a new customer, When I visit the registration page, Then I can create a new account securely."],"test_cases":["Given a new customer, When they visit the registration page, Then the customer account is created securely."]},{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":2,"title":"Implement Multi-Factor Authentication","description":"As a customer, I want to verify my login using an additional layer such as OTP or biometric verification so that my account remains secure.","priority_business_value":"High","attributes_and_rules":["The system must support multiple MFA methods such as OTP, email verification, and biometric authentication."],"core_domain_objects":["Customer","MFA Token"],"acceptance_criteria":["Given I am a logged-in customer, When I am prompted for MFA, Then I can successfully verify my identity with a second factor."],"test_cases":["Given a logged-in customer, When they are prompted for MFA, Then the customer successfully verifies their identity using the selected MFA method."]},{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":3,"title":"Password Recovery Functionality","description":"As a customer, I want a secure password reset option so that I can recover my access when necessary.","priority_business_value":"Medium","attributes_and_rules":["The system must provide secure and easy-to-use password recovery options."],"core_domain_objects":["Customer","User Account"],"acceptance_criteria":["Given I am a customer who forgot my password, When I click on the password recovery link, Then I am guided through a secure password reset process."],"test_cases":["Given a customer who forgot their password, When they click on the password recovery link, Then the password reset process is completed securely."]},{"epic_title":"Responsive User Interface Design","epic_key":"EPIC-2","number":1,"title":"Responsive Portal Layout","description":"As a customer, I want the portal to adjust to my screen size so that I can easily use it on any device.","priority_business_value":"High","attributes_and_rules":["The portal must automatically adjust its layout to fit different screen sizes including desktop, tablet, and mobile."],"core_domain_objects":["Portal"],"acceptance_criteria":["Given I am a customer, When I access the portal on any device, Then the layout adjusts to fit the screen size."],"test_cases":["Given a customer, When they access the portal on a desktop, tablet, or mobile device, Then the layout adjusts accordingly."]},{"epic_title":"Responsive User Interface Design","epic_key":"EPIC-2","number":2,"title":"Intuitive Navigation System","description":"As a customer, I want an easy and intuitive navigation system so that I can quickly find the services I need.","priority_business_value":"High","attributes_and_rules":["The navigation system must be intuitive and allow customers to quickly find services."],"core_domain_objects":["Portal"],"acceptance_criteria":["Given I am a customer, When I navigate the portal, Then I can easily find the services I need."],"test_cases":["Given a customer, When they navigate the portal, Then they can quickly and easily find the needed services."]},{"epic_title":"Personalized Dashboard and Profile Management","epic_key":"EPIC-3","number":1,"title":"Display Personalized Account Information","description":"As a customer, I want to view my personalized account summary so that I can easily monitor my banking activities.","priority_business_value":"High","attributes_and_rules":["Personalized account information must be securely displayed."],"core_domain_objects":["Customer","Account"],"acceptance_criteria":["Given I am a logged-in customer, When I visit my dashboard, Then I see my personalized account summary."],"test_cases":["Given a logged-in customer, When they visit the dashboard, Then the personalized account summary is correctly displayed."]},{"epic_title":"Personalized Dashboard and Profile Management","epic_key":"EPIC-3","number":2,"title":"Recommend Eligible Products","description":"As a customer, I want to see eligible banking products based on my profile so that I can explore relevant services.","priority_business_value":"Medium","attributes_and_rules":["Product recommendations must be relevant and personalized based on customer's profile."],"core_domain_objects":["Customer","Product"],"acceptance_criteria":["Given I am a logged-in customer, When I visit my dashboard, Then I see recommendations for eligible banking products."],"test_cases":["Given a logged-in customer, When they visit the dashboard, Then the relevant eligible products are displayed."]},{"epic_title":"Account and Service Request Workflows","epic_key":"EPIC-4","number":1,"title":"Online Account Opening","description":"As a customer, I want to open an account online so that I do not have to visit a branch.","priority_business_value":"High","attributes_and_rules":["Account opening must be available online with minimal steps."],"core_domain_objects":["Customer","Account"],"acceptance_criteria":["Given I am a new customer, When I complete the online account opening process, Then my new account is created without needing to visit a branch."],"test_cases":["Given a new customer, When they complete the online account opening process, Then the new account is successfully created."]},{"epic_title":"Account and Service Request Workflows","epic_key":"EPIC-4","number":2,"title":"Service Modification Requests","description":"As a customer, I want to modify my existing banking services online so that I can manage changes conveniently.","priority_business_value":"Medium","attributes_and_rules":["Service modification must be user-friendly and conveniently accessible online."],"core_domain_objects":["Customer","Service Request"],"acceptance_criteria":["Given I am a logged-in customer, When I request to modify a service, Then I am able to complete and submit the modification online."],"test_cases":["Given a logged-in customer, When they request to modify a service, Then the modification is successfully submitted online."]},{"epic_title":"Account and Service Request Workflows","epic_key":"EPIC-4","number":3,"title":"Save and Resume Applications","description":"As a customer, I want to save partially completed applications so that I can return to them later without losing my progress.","priority_business_value":"Medium","attributes_and_rules":["Partially completed applications must be saved and retrievable."],"core_domain_objects":["Customer","Application"],"acceptance_criteria":["Given I am a customer, When I partially complete an application and save it, Then I can resume from where I left off at a later time."],"test_cases":["Given a customer, When they partially complete and save an application, Then the application is properly saved and recoverable."]},{"epic_title":"Status Tracking and Notifications","epic_key":"EPIC-5","number":1,"title":"Display Real-Time Application Status","description":"As a customer, I want to see real-time updates on my application so that I know the progress of my request.","priority_business_value":"High","attributes_and_rules":["Real-time status updates must be accurately reflected."],"core_domain_objects":["Customer","Application Status"],"acceptance_criteria":["Given I am a customer, When I submit an application, Then I can see real-time status updates on my dashboard."],"test_cases":["Given a customer, When they submit an application, Then the real-time status updates appear correctly on their dashboard."]},{"epic_title":"Status Tracking and Notifications","epic_key":"EPIC-5","number":2,"title":"Receive Email Notifications","description":"As a customer, I want to receive email updates whenever the status of my application changes so that I stay informed.","priority_business_value":"Medium","attributes_and_rules":["Email notifications must be timely and accurately reflect changes."],"core_domain_objects":["Customer","Notification"],"acceptance_criteria":["Given I am a customer, When the status of my application changes, Then I receive an email notification reflecting the update."],"test_cases":["Given a customer, When the status of their application changes, Then an accurate email notification is received."]},{"epic_title":"Document Upload and Management System","epic_key":"EPIC-6","number":1,"title":"Secure Document Upload","description":"As a customer, I want to securely upload required documents so that my requests can be processed efficiently.","priority_business_value":"High","attributes_and_rules":["Document uploads must be secured with encryption."],"core_domain_objects":["Customer","Document"],"acceptance_criteria":["Given I am a customer, When I upload a document, Then it is securely transferred and stored."],"test_cases":["Given a customer, When they upload a document, Then the document upload is completed securely."]},{"epic_title":"Document Upload and Management System","epic_key":"EPIC-6","number":2,"title":"Document Validation","description":"As a system, I want to validate uploaded documents for type and completeness so that only correct files are processed.","priority_business_value":"High","attributes_and_rules":["Uploaded documents must be validated for correct type and completeness."],"core_domain_objects":["Document"],"acceptance_criteria":["Given an uploaded document, When it is processed, Then it is validated for type and completeness."],"test_cases":["Given an uploaded document, When it is processed, Then validation for correct type and completeness is performed."]},{"epic_title":"Role-Based Access Control","epic_key":"EPIC-7","number":1,"title":"Set Role Definitions and Permissions","description":"As an administrator, I want to define separate roles and permissions so that users can only access the information relevant to them.","priority_business_value":"High","attributes_and_rules":["Roles and permissions must be clearly defined and enforced."],"core_domain_objects":["User Role","Permission"],"acceptance_criteria":["Given I am an administrator, When I define a role, Then I can assign appropriate permissions to it."],"test_cases":["Given an administrator, When they define a role, Then they can assign correct permissions to the role."]},{"epic_title":"Role-Based Access Control","epic_key":"EPIC-7","number":2,"title":"Apply Role Validation on Login","description":"As a system, I want to enforce role validations during login so that unauthorized actions are prevented.","priority_business_value":"High","attributes_and_rules":["Role validations must be performed during user login."],"core_domain_objects":["User Role"],"acceptance_criteria":["Given I am a customer or staff, When I log in, Then my role permissions are validated and enforced."],"test_cases":["Given a customer or staff, When they log in, Then role permissions are correctly validated and enforced."]},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-8","number":1,"title":"Synchronize Customer Data via APIs","description":"As a system, I want to synchronize customer and account data with the core banking system so that user information is always up-to-date.","priority_business_value":"High","attributes_and_rules":["Customer data synchronization with the core banking system must be seamless and accurate."],"core_domain_objects":["Customer","Account"],"acceptance_criteria":["Given new or updated customer data, When synchronization is performed, Then the core banking system reflects the correct, up-to-date data."],"test_cases":["Given new or updated customer data, When synchronization is performed, Then the core banking system data is accurately updated."]},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-8","number":2,"title":"Handle Integration Failures Gracefully","description":"As a system, I want to log and recover from integration errors so that services remain uninterrupted.","priority_business_value":"High","attributes_and_rules":["Integration errors must be logged and handled without service interruption."],"core_domain_objects":["System Logs","Error Handling"],"acceptance_criteria":["Given an integration error, When it occurs, Then the system logs the error and continues to operate without interruption."],"test_cases":["Given an integration error, When it occurs, Then the error is correctly logged and the system remains functional."]},{"epic_title":"Data Security and Audit Management","epic_key":"EPIC-9","number":1,"title":"Encrypt Sensitive Data","description":"As a system, I want to encrypt sensitive user information so that data is secure both in transit and at rest.","priority_business_value":"High","attributes_and_rules":["Sensitive user data must be encrypted in transit and at rest."],"core_domain_objects":["User Data"],"acceptance_criteria":["Given sensitive data, When it is stored or transmitted, Then it is encrypted to ensure security."],"test_cases":["Given sensitive data, When it is stored or transmitted, Then encryption is applied correctly for security."]},{"epic_title":"Data Security and Audit Management","epic_key":"EPIC-9","number":2,"title":"Maintain Audit Trail","description":"As a customer, I want to view my past actions and service interactions so that I can track my digital banking history.","priority_business_value":"Medium","attributes_and_rules":["Complete and accurate audit trails must be maintained for all user actions."],"core_domain_objects":["User Actions","Audit Logs"],"acceptance_criteria":["Given I am a customer, When I access my audit trail, Then I can see a detailed log of my past actions and service interactions."],"test_cases":["Given a customer, When they access their audit trail, Then a complete and accurate log is presented."]}]