[{"epic_title":"Secure User Authentication with Multi-Factor Login","epic_key":"EPIC-1","number":1,"title":"User Login with Multi-Factor Authentication","description":"As a customer, I want to log in using multi-factor authentication, so that I can securely access my account.","priority_business_value":"High","attributes_and_rules":"Login module must support OTP and authenticator app for multi-factor authentication. Password recovery options should be available.","core_domain_objects":"User, Authentication","acceptance_criteria":"1. System should require two-factor authentication for access. 2. Password recovery process should be available.","test_cases":"Given a registered user, when they attempt to log in, then the system should prompt for multi-factor authentication."},{"epic_title":"Secure User Authentication with Multi-Factor Login","epic_key":"EPIC-1","number":2,"title":"Session Timeout Handling","description":"As a customer, I want my session to timeout after a period of inactivity, so that my account remains secure.","priority_business_value":"Medium","attributes_and_rules":"System should automatically logout users after a predefined period of inactivity to enhance security.","core_domain_objects":"Session","acceptance_criteria":"1. System should log out users after 15 minutes of inactivity. 2. Users should receive a warning before session timeout.","test_cases":"Given a logged-in user, when the system detects 15 minutes of inactivity, then it should log the user out and display a session timeout message."},{"epic_title":"Secure User Authentication with Multi-Factor Login","epic_key":"EPIC-1","number":3,"title":"Device Recognition Features","description":"As a customer, I want the system to recognize my device, so that I can log in more conveniently.","priority_business_value":"Low","attributes_and_rules":"System should remember recognized devices for faster login.","core_domain_objects":"Device","acceptance_criteria":"1. System should remember devices after successful multi-factor authentication. 2. Users should be able to manage their recognized devices.","test_cases":"Given a user logs in with multi-factor authentication, when they choose to remember their device, then the system should recognize the device on subsequent logins."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-2","number":1,"title":"Responsive Design for Multiple Devices","description":"As a user, I want the portal to work consistently across all my devices, so that I have a seamless experience.","priority_business_value":"High","attributes_and_rules":"The UI must be responsive and adapt to different devices such as desktop, tablet, and mobile. Maintain a unified brand experience.","core_domain_objects":"User Interface","acceptance_criteria":"1. UI should display correctly on all screen sizes. 2. Usability must be consistent across devices.","test_cases":"Given different devices, when users access the portal, then the UI should adapt seamlessly to the respective screen size."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-2","number":2,"title":"Accessibility Compliance","description":"As a user, I want the portal to be accessible for individuals with disabilities, so that everyone can use it effectively.","priority_business_value":"High","attributes_and_rules":"Ensure compliance with accessibility standards such as WCAG 2.1.","core_domain_objects":"User Interface","acceptance_criteria":"1. Portal must be navigable via screen readers. 2. Ensure high contrast and scalable fonts for readability.","test_cases":"Given a user with accessibility needs, when they use the portal, then all accessibility features should work without any issues."},{"epic_title":"Personalized Dashboard and Product Eligibility Display","epic_key":"EPIC-3","number":1,"title":"Personalized Account Overview","description":"As a user, I want to see a personalized overview of my accounts, so that I can quickly access important information.","priority_business_value":"High","attributes_and_rules":"Dashboard should display account summaries and personalized information based on user data.","core_domain_objects":"User, Account","acceptance_criteria":"1. Dashboard must reflect real-time account information. 2. Personalization should based on user's profile and preferences.","test_cases":"Given a logged-in user, when they view the dashboard, then it should show a personalized summary of their accounts."},{"epic_title":"Personalized Dashboard and Product Eligibility Display","epic_key":"EPIC-3","number":2,"title":"Display Product Eligibility","description":"As a user, I want to see products I am eligible for, so that I can take advantage of relevant offers.","priority_business_value":"Medium","attributes_and_rules":"Eligibility information must be displayed accurately based on the user's profile and account status.","core_domain_objects":"User, Product","acceptance_criteria":"1. Eligible products should be updated in real-time based on data synchronization. 2. Users should see specific reasons for their eligibility.","test_cases":"Given a user's profile data, when they view the dashboard, then it should show their eligible products and services."},{"epic_title":"Account Opening and Service Request Workflows","epic_key":"EPIC-4","number":1,"title":"Guided Account Opening Workflow","description":"As a user, I want a guided workflow to open a new account, so that I can do it easily and efficiently.","priority_business_value":"High","attributes_and_rules":"Workflow should have clear steps and dynamic validations to reduce errors.","core_domain_objects":"Account, Workflow","acceptance_criteria":"1. Account opening should be streamlined with minimum steps. 2. Dynamic validations must ensure correct information submission.","test_cases":"Given a user opening an account, when they follow the guided steps, then the process should be smooth and error-free."},{"epic_title":"Request Tracking and Notification System","epic_key":"EPIC-5","number":1,"title":"Real-time Request Tracking","description":"As a user, I want to track my service request status in real-time, so that I know the progress of my request.","priority_business_value":"High","attributes_and_rules":"System must provide real-time updates on request status and send notifications upon status changes.","core_domain_objects":"Request","acceptance_criteria":"1. Users should see real-time request statuses. 2. Notifications must be sent via email or portal alerts for each status change.","test_cases":"Given a user's submitted request, when its status changes, then the system should update the status in real-time and send a notification."},{"epic_title":"Document Upload and Application Continuation Feature","epic_key":"EPIC-6","number":1,"title":"Secure Document Upload","description":"As a user, I want to securely upload documents, so that my information is protected.","priority_business_value":"High","attributes_and_rules":"Document upload feature must support multiple file formats and handle size validations. Implement security measures like encryption and secure storage.","core_domain_objects":"Document","acceptance_criteria":"1. Users must be able to upload documents securely. 2. System should validate file formats and sizes.","test_cases":"Given a document upload feature, when users upload files, then the system should validate and store the documents securely."}]